# Taps
tap "homebrew/bundle"

# Core tools
brew "git"
brew "gh"
brew "mise"
brew "stow"
brew "starship"
brew "jq"
brew "yq"
brew "wget"
brew "curl"

# Development
brew "direnv"
brew "lefthook"
brew "src-cli"

# Languages & runtimes
brew "python@3.13"
brew "ruby-build"
brew "rbenv"

# Database
brew "postgresql@16"
brew "redis"

# Security
brew "gitleaks"
brew "gnupg"

# Mobile
brew "cocoapods"
brew "watchman"

# Casks
cask "1password-cli"
